БухЭксп/Catalogs/CW_ОбъектыАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбъектыАрхива</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВладельцыАрхива</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла без расширения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТомаАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗахвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРедактор</Name>
					<Comment>Пользователь захвативший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОблаке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАрхиваВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХраненияАрхива</Name>
					<Comment>0 - прикреплен,1 - в облаке; 2 - ссылка на ранее прикрепленный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбъектыАрхива/Forms/ФайлыОбъекта/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("РежимВыбора",	РежимВыбора);
	Параметры.Свойство("ОбъектАрхива",	ОбъектАрхива);
	Если ОбъектАрхива = Неопределено Тогда
		ВызватьИсключение "Не указан объект архива!";
	КонецЕсли;

	ТекущийПользователь = CW_Настройки.Пользователь();  
	
	ЗапрашиватьТипФайлаПриДобавленииВАрхив 	= Константы.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив.Получить();
	НепосредственноеУдаление = CW_ПраваДоступа.ПравоДоступно("НепосредственноеУдалениеОбъектовАрхива");
	
	ЭтаФорма.АвтоЗаголовок = Ложь;
	ЭтаФорма.Заголовок = "Файлы: " + СокрЛП(ОбъектАрхива);
	
	ВладелецАрхива = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(ОбъектАрхива);
	
	ЭлементОтбора = СписокФайлы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Владелец");
  	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ВладелецАрхива;
	ЭлементОтбора.Использование 	= Истина;

	// проверяем доступность основного тома
	ОсновнойТомХранения = CW_РаботаСФайламиСервер.ПолучитьОсновнойТомХранения();
	Если ЗначениеЗаполнено(ОсновнойТомХранения) Тогда
		ОсновнойТомДоступен = ОсновнойТомХранения.Активный и Не ОсновнойТомХранения.ТолькоЧтение;
	КонецЕсли;   
	
	Элементы.СписокФайлы.ТолькоПросмотр					= Не ОсновнойТомДоступен;
	Элементы.ФормаДобавитьФайлВГрузоперевозки.Видимость	= ТипЗнч(ОбъектАрхива) = Тип("СправочникСсылка.CW_Заказы");

	Если Элементы.Найти("ФормаУдалить") <> Неопределено Тогда
		Элементы.ФормаУдалить.Видимость = НепосредственноеУдаление;
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьПредварительногоПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатУдаленияФайлов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Элементы.СписокФайлы.Обновить();
		ОповеститьОбИзменении(ОбъектАрхива);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка "+Дополнительныепараметры+" файлов!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка "+Дополнительныепараметры+" файлов");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресМиниатюрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа(ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = CW_РаботаСФайламиКлиент.ДанныеФайла(ТекущаяСтрока, УникальныйИдентификатор);	
	CW_РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		Оповестить("ОбновитьНаличиеПрикрепленныхФайлов",ОбъектАрхива);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлВГрузоперевозки(Команда)
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа(ТекущаяСтрока) Тогда
		ПоказатьПредупреждение(,"Выберите элемент!");
		Возврат;
	КонецЕсли;
	
	АдресСпискаГрузоперевозок = ПолучитьАдресСпискаГрузоперевозокЗаказа();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаЗначений"	, АдресСпискаГрузоперевозок);
	ПараметрыФормы.Вставить("СписокСПометками"		, Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы"		, "Выберите грузоперевозки для помещения файла");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОбъектАрхива", 	ТекущаяСтрока);
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораГрузоперевозок", ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораГрузоперевозок(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(РезультатВыбора) Тогда
		
		РезультатВыполнения =  ОбработатьРезультаВыбораНаСервере(РезультатВыбора, ДополнительныеПараметры);
		
		Дополнительныепараметры = Новый Структура;
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбрабтатьРезультатаФоновогоЗаданая", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьРезультаВыбораНаСервере(РезультатВыбора, ДополнительныеПараметры)
	
	ВыбранныеЭлементы = ПолучитьИзВременногоХранилища(РезультатВыбора);

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Добавление файлов к грузоперевозкам";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	
	ПараметрыПроцедуры.Вставить("ВыбранныеЭлементы", ВыбранныеЭлементы);
	ПараметрыПроцедуры.Вставить("ОбъектАрхива",		 ДополнительныеПараметры.ОбъектАрхива);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ОбъектыАрхива.ДобавитьСсылкуНаОбъектАрхиваДляВыбранныхГрузоперевозок",ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ОбрабтатьРезультатаФоновогоЗаданая(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		КоличествоПеревозок = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		ПоказатьОповещениеПользователя("Добавление файлов к грузоперевозкам",,"Обработано "+Формат(КоличествоПеревозок,"ЧГ=0")+" грузоперевозок");
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка добавления файлов к грузоперевозкам!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка добавления файлов к грузоперевозкам");
		
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Функция ПолучитьАдресСпискаГрузоперевозокЗаказа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
	               |	CW_Грузоперевозки.CW_Представление КАК Представление
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", ОбъектАрхива);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СписокВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;

	Возврат ПоместитьВоВременноеХранилище(СписокВыбора, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СписокФайлыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикПоказаМиниатюры",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПоказаМиниатюры() 
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") тогда
		Возврат;
	КонецЕсли;
	
	ДанныеМиниатюры = ПолучитьДанныеНаСервере(ТекущаяСтрока); 
	Если ДанныеМиниатюры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеМиниатюры["Данные"]) = Тип("ДвоичныеДанные") Тогда
		ПотокВПамяти = ДанныеМиниатюры["Данные"].ОткрытьПотокДляЧтения(); 
		Попытка
			ДокументPDF.Прочитать(ПотокВПамяти);  
		Исключение
			ДанныеМиниатюры["ТекущаяСтраница"] = "СтраницаВсеФайлы";
		КонецПопытки;
	ИначеЕсли ТипЗнч(ДанныеМиниатюры["Данные"]) = Тип("Строка") Тогда
		АдресМиниатюры = ДанныеМиниатюры.Данные;	
	КонецЕсли;  
	
	Элементы.СтраницыПредпросмотра.ТекущаяСтраница = Элементы[ДанныеМиниатюры.ТекущаяСтраница];
	
КонецПроцедуры
  
&НаСервере
Функция ПолучитьДанныеНаСервере(Знач Ссылка) 
	
	Если ТипЗнч(Ссылка) = Тип("СтрокаГруппировкиДинамическогоСписка") тогда
		Возврат Неопределено;
	КонецЕсли;

	СписокРасширений = РаботаСФайламиСлужебный.СписокРасширенийДляПредпросмотра(); 
	СписокРасширений.Добавить("pdf");
	
	Расширение 			= СтрЗаменить(НРег(Ссылка.Расширение), ".","");
	Если СписокРасширений.НайтиПоЗначению(Расширение) = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;

	ДанныеМиниатюры = Новый Структура("Данные,ТекущаяСтраница", "","СтраницаВсеФайлы");
	
	ДвоичныеДанные  = CW_РаботаСФайламиСервер.ДвоичныеДанныеФайла(Ссылка);
	
	Если Расширение = "pdf" Тогда
		ДанныеМиниатюры.Данные 			= ДвоичныеДанные;
		ДанныеМиниатюры.ТекущаяСтраница = "СтраницаФайлыPDF"; 
	Иначе
		ДанныеМиниатюры.Данные 			=  ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		ДанныеМиниатюры.ТекущаяСтраница =  "СтраницаВсеФайлы";
	КонецЕсли;
	
	Возврат ДанныеМиниатюры;
	
КонецФункции

&НаКлиенте
Процедура СписокФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;   
	
	Если Группа Тогда 
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Владелец",	ВладелецАрхива);
		ЗначенияЗаполнения.Вставить("Родитель",	Родитель);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЭтоГруппа", 			Группа);
		СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Справочник.CW_ОбъектыАрхива.ФормаГруппы", СтруктураПараметров, ЭтаФорма); 
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Родитель", Родитель);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайловНаСервер", ЭтотОбъект, ДополнительныеПараметры); 
		
		ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
		ПараметрыДиалога.Заголовок  			= "Выберите файлы";
		ПараметрыДиалога.Фильтр					= "(*.*)|*.*";
		ПараметрыДиалога.МножественныйВыбор	 	= Истина;  
		НачатьПомещениеФайловНаСервер(ОписаниеОповещения,,,ПараметрыДиалога, ЭтаФорма.УникальныйИдентификатор);  
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайловНаСервер(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;      
	
	МассивПомещенныеФайлы = Новый Массив;
	Для Каждого ПомещенныйФайл из ПомещенныеФайлы Цикл
		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("Имя", 		ПомещенныйФайл.СсылкаНаФайл.Имя);
		ДанныеФайла.Вставить("Расширение", 	ПомещенныйФайл.СсылкаНаФайл.Расширение);
		ДанныеФайла.Вставить("Хранение", 	ПомещенныйФайл.Адрес);
		
		МассивПомещенныеФайлы.Добавить(ДанныеФайла);	
	КонецЦикла;
	
	ДополнительныеПараметры.Вставить("ПомещенныеФайлы", МассивПомещенныеФайлы);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПомещениеФалов", ЭтотОбъект, ДополнительныеПараметры);
	
	Если ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
		
		ПараметрыВыбора = новый Структура;
		ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);  
		
		ОткрытьФорму("Справочник.CW_ТипыДокументовФайловогоАрхива.ФормаВыбора",ПараметрыВыбора, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе   
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения,Неопределено);   
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПомещениеФалов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено и ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
		ПоказатьПредупреждение(,"Не выбран тип документа. Добавление файла отменено!"); 
		Возврат;
	КонецЕсли;    
	
	МассивОбъектов = новый Массив;
	МассивОбъектов.Добавить(ОбъектАрхива);
	
	Успешно = CW_РаботаСФайламиСервер.ПрикрепитьФайлы(ДополнительныеПараметры.ПомещенныеФайлы, МассивОбъектов, РезультатВыбора,  ДополнительныеПараметры.Родитель); 
	
	Если Не Успешно Тогда
		ПоказатьПредупреждение(, "Не удалось добавить файл!", ,"Ошибка добавления файла");
	Иначе
		ОповеститьОбИзменении(ОбъектАрхива); 
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ОбъектыАрхива")); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСсылкуНаФайл(Команда)
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		Родитель = ПолучитьРодителяПоТекущейСсылке(ТекущаяСтрока);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Родитель", Родитель);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередНачаломДобавленияСсылки", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.CW_ОбъектыАрхива.Форма.ФормаДобавленияСсылкиНаФайл", ,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПолучитьРодителяПоТекущейСсылке(Ссылка)

	Если ТипЗнч(Ссылка) = Тип("СтрокаГруппировкиДинамическогоСписка") тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Ссылка.ЭтоГруппа Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	Возврат Ссылка.Родитель;   
	
КонецФункции

&НаКлиенте
Процедура ПередНачаломДобавленияСсылки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Результат", Результат);
	
	ПараметрыВыбора = новый Структура;
	ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораТипаДокумента", ЭтотОбъект, ДополнительныеПараметры);
	
	Если ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
		ОткрытьФорму("Справочник.CW_ТипыДокументовФайловогоАрхива.ФормаВыбора",ПараметрыВыбора,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения,Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаДокумента(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено и ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
		ПоказатьПредупреждение(,"Не выбран тип документа. Добавление файла отменено!"); 
		Возврат;
	КонецЕсли;    
	
	CW_РаботаСФайламиСервер.ДобавитьСсылкуНаФайл(ДополнительныеПараметры.Результат, ОбъектАрхива, ДополнительныеПараметры.Родитель, РезультатВыбора);
	
	Элементы.СписокФайлы.Обновить();
	
	ОповеститьОбИзменении(ОбъектАрхива);

КонецПроцедуры     

&НаКлиенте
Процедура ДобавитьСсылкуНаРанееПрикрепленныйФайл(Команда)
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		Родитель = ПолучитьРодителяПоТекущейСсылке(ТекущаяСтрока);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Родитель", Родитель);

	ПараметрыВыбора = новый Структура;
	ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПрикрепленныхФайлов", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("Справочник.CW_ОбъектыАрхива.ФормаВыбора", ПараметрыВыбора, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПрикрепленныхФайлов(ДобавляемаяСсылка, ДополнительныеПараметры) Экспорт
	
	Если ДобавляемаяСсылка = Неопределено Тогда
		Возврат; 
	КонецЕсли;     
	
	Массив = Новый Массив;
	Массив.Добавить(ДобавляемаяСсылка);
	
	CW_РаботаСФайламиСервер.ДобавитьНаРанееПрикрепленныйФайл(Массив, ОбъектАрхива, ДополнительныеПараметры.Родитель);

	Элементы.СписокФайлы.Обновить();
	
	ОповеститьОбИзменении(ОбъектАрхива);
	
КонецПроцедуры    

&НаКлиенте
Процедура ДобавитьФайлыСвязанныхОбъектов(Команда) 
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		Родитель = ПолучитьРодителяПоТекущейСсылке(ТекущаяСтрока);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Родитель", Родитель);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВладелецФайлов", ОбъектАрхива); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораДобавляемыхСсылок", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("Справочник.CW_ОбъектыАрхива.Форма.ФормаПодбораФайлов", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДобавляемыхСсылок(ВыбранныеСсылки, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеСсылки = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	CW_РаботаСФайламиСервер.ДобавитьНаРанееПрикрепленныйФайл(ВыбранныеСсылки, ОбъектАрхива, ДополнительныеПараметры.Родитель);
	
	Элементы.СписокФайлы.Обновить();
	
	ОповеститьОбИзменении(ОбъектАрхива);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппа(Ссылка)

	Возврат Ссылка.ЭтоГруппа;
	
КонецФункции 

&НаСервереБезКонтекста
Функция СпособХраненияАрхива(Ссылка)

	Возврат Ссылка.СпособХраненияАрхива;
	
КонецФункции   

&НаКлиенте
Процедура ОткрытьФайлДляПросмотра(Команда)
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа(ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;   
	
	ДанныеФайла = CW_РаботаСФайламиКлиент.ДанныеФайла(ТекущаяСтрока, УникальныйИдентификатор);	
	CW_РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеОткрытияПриложения(КодВозврата,ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКак(Команда)
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа(ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли; 
	
	ДанныеФайла = CW_РаботаСФайламиКлиент.ДанныеФайла(ТекущаяСтрока, УникальныйИдентификатор);	
	CW_РаботаСФайламиКлиент.СохранитьКак(ДанныеФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВКаталог(Команда)
	
	ВыделенныеСтроки = Элементы.СписокФайлы.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПолучаемыеФайлы = ПолучитьМассивПолучаемыхФайлов(ВыделенныеСтроки);
	Если ПолучаемыеФайлы.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не удалось получить данные. Проверьте существование файлов в томе!");
		Возврат;
	КонецЕсли;    
	
	ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
	ПараметрыДиалогаПолученияФайлов.ВыборКаталога 	= Истина;
	ПараметрыДиалогаПолученияФайлов.Заголовок 		= "Выберите каталог для сохранения выбранынх файлов";
	
	НачатьПолучениеФайловССервера(ПолучаемыеФайлы, ПараметрыДиалогаПолученияФайлов)
	
КонецПроцедуры    

&НаКлиенте
Функция ПолучитьМассивПолучаемыхФайлов(ВыделенныеСтроки)
	
	ПолучаемыеФайлы = Новый Массив; 
	
	Для Каждого Ссылка из ВыделенныеСтроки Цикл
		
		Если ЭтоГруппа(Ссылка) Тогда
			Продолжить;
		КонецЕсли;   
		
		Если СпособХраненияАрхива(Ссылка) = 1 Тогда
			Продолжить;
		КонецЕсли;

		ДанныеФайла = CW_РаботаСФайламиКлиент.ДанныеФайла(Ссылка, Новый УникальныйИдентификатор);
		Если ДанныеФайла.СсылкаНаДвоичныеДанныеФайла = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеПередаваемогоФайла = Новый ОписаниеПередаваемогоФайла;
		ОписаниеПередаваемогоФайла.Имя 		= ДанныеФайла.ИмяФайлаДляСохранения;
		ОписаниеПередаваемогоФайла.Хранение = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
	
		ПолучаемыеФайлы.Добавить(ОписаниеПередаваемогоФайла);
		
	КонецЦикла;
	
	Возврат ПолучаемыеФайлы;
	
КонецФункции  

&НаКлиенте
Процедура СписокФайлыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)    
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры   


&НаКлиенте
Процедура СписокФайлыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) 
	

	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") 
		и ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.CW_ОбъектыАрхива") Тогда  
		//Перетаскивание в пределах спискоа стандратно
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;    
	
	Если Не ОсновнойТомДоступен Тогда
		ПоказатьПредупреждение(, "Основной том хранения файлов не доступен!");
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		Родитель = ПолучитьРодителяПоТекущейСсылке(ТекущаяСтрока);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Родитель", Родитель);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайловНаСервер", ЭтотОбъект, ДополнительныеПараметры);  
	
	ОписанияПередаваемыхФайлов = новый Массив; 
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СсылкаНаФайл") Тогда  
		
		ОписаниеПередаваемогоФайла = Новый ОписаниеПередаваемогоФайла;
		ОписаниеПередаваемогоФайла.Имя = ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя;
		
		ОписанияПередаваемыхФайлов.Добавить(ОписаниеПередаваемогоФайла);
		
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		
		Для каждого СсылкаНаФайл из ПараметрыПеретаскивания.Значение Цикл 
			Если ТипЗнч(СсылкаНаФайл) = Тип("СсылкаНаФайл") Тогда  
				ОписаниеПередаваемогоФайла = Новый ОписаниеПередаваемогоФайла;
				ОписаниеПередаваемогоФайла.Имя = СсылкаНаФайл.Файл.ПолноеИмя;
				
				ОписанияПередаваемыхФайлов.Добавить(ОписаниеПередаваемогоФайла); 
			КонецЕсли;  
		КонецЦикла;  
		
	КонецЕсли;
	
	Если ОписанияПередаваемыхФайлов.Количество() > 0 Тогда
		НачатьПомещениеФайловНаСервер(ОписаниеОповещения,,, ОписанияПередаваемыхФайлов, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура СписокФайлыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПредпросмотр(Команда)
	
	ПредварительныйПросмотр = Не ПредварительныйПросмотр;
	
	УстановитьВидимостьПредварительногоПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПредварительногоПросмотра()
	
	Элементы.СтраницыПредпросмотра.Видимость  = ПредварительныйПросмотр;
	Элементы.ФормаКомандаПредпросмотр.Пометка = ПредварительныйПросмотр;

КонецПроцедуры


&НаКлиенте
Процедура УдалитьЭлемент(Команда) 
	
	ТекущаяСтрока = Элементы.СписокФайлы.ТекущаяСтрока;    
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ссылка", ТекущаяСтрока);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдалении", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Удалить "+СокрЛП(ТекущаяСтрока)+"?", Режим, 0);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдалении(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	УдалитьЭлементНаСервере(ДополнительныеПараметры.Ссылка); 
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ОбъектыАрхива"));

КонецПроцедуры  

&НаСервере
Процедура УдалитьЭлементНаСервере(ТекущаяСтрока)  
	
	УстановитьПривилегированныйРежим(Истина);
	СправочникОбъект = ТекущаяСтрока.ПолучитьОбъект();
	СправочникОбъект.Удалить();

КонецПроцедуры
